{"aggregateRating": {"reviewCount": 3633, "@type": "AggregateRating", "ratingValue": 4.2766308835673}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "We put our name on the list for our group of 7 and were told a 2 hour wait (which we expected). When our text came, we headed that way only to be told that they couldn't seat 7 together (nothing over 6 unless you want to be at separate tables). This wouldn't have been annoying except that they took our reservation for 7 and at that time, told my son they would just pull up an extra chair to a table. Turns out that is not allowed. The staff was very accommodating in trying to resolve this issue for us and ended up finding 2 tables for us that were next to each other. It all worked out!\nFor starters, I tried the Boo Radley based on our server's recommendation of a drink for someone who likes both Manhattans and Old Fashions. It was perfect! In fact, I really hope hubby can replicate it once we get home\nManagement brought us 2 complimentary dishes to try - crispy potato hash with duck heart gravy and general jane's honey-fried chicken. They were both excellent!! The chicken dish had probably 6 pieces of chicken and was a huge portion. The hash was a dish I may not have tried on my own, so having them bring it to us was terrific. I would definitely order it on my own and my son who has been there numerous times for the burger thought it might be a new favorite! Everyone at the table ordered the burger and we got a basket of fries to share. The burgers were really good - great flavor and moist. Personally, I would ask for the sauce on the side the next time because I felt that for me the amount was too much and overpowered the quality of the meat itself. \nWe were treated to 2 desserts and I think our table absolutely loved the ice cream trio!! If you are at all still hungry, it's a wonderful way to finish your evening. They also brought us a three tiered dessert that even though I'm not sure what it was called, we managed to finish that off as well! \nThis is a top notch restaurant both in the quality of the food they serve, the staff they hire and the way management addresses concerns and problems that may arise. We will be back!!", "author": "Kathy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Holy cow! (Pun not originally intended but happy it happened) \nI'm not a burger person, but this burger has restored my faith in America. \nSalad was also delicious, beer list great, and the bone marrow at the table next to me had my mouth watering. I feel like I just had a religious experience with this burger.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "Went on a Wednesday afternoon at 2:00 and still had to wait about 20 minutes, which is fine, it's in a nice area, there are places to walk, shop or have a drink. \nBut we found the service and food lacking.\nWe ordered drinks first, my wine came in about 15 minutes, but my husband was told they were \"changing the keg\" so he would have to wait. So my husband had no drink for over 30 minutes. Now, my husband ran restaurants for years, and he was not impressed. He understood that things happen, but no discount, no apology. It was like it was our honor to have been served at such a popular spot, so deal...\nOur burgers were tasty, but they were NOT the best burgers we had ever had. Not even the best burger in Chicago, we have all had better. Our burger was very salty as were the french fries. Not sure if we came on a day the top of the salt shaker fell off or what, but I wouldn't recommend eating here with any sort of blood pressure issue that's for sure.\nDon't get me wrong, the burger was not awful, but whenever a food is over salted it is usually due to lack of quality in the food, and a way to cover that up.\nWe came, we ate, we won't be back and we won't recommend anyone else wait for the average meal and service we had.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-25", "description": "Difficult to give it a 4 star for many factors, had to settle with 3 stars for now.  On our last day, we stopped by at 10am (opening time) based upon recommendation from a friend.  We were warned that there can be a long line (no kidding)... even getting there at 10am, we had to wait an hour to get seated.  \n\nWe got a corner seat all the way to the back... tables are tightly arranges, so if you are seating at the bench, it can be difficult to slide in and out.  From outside, this place look big, but when you walk in, that perception disappears... the kitchen is behind the bar and not that big, thus the time it takes to get your food will depend on how busy they are.\n\nWe got here on Sunday and we were presented with their brunch menu, since this place was known for their cheeseburger, why order anything else?  So, here's what we ordered:\n\n- cheeseburger á cheval .\n- fries with mornay sauce, garlic aioli & fried farm egg\n- thick cut peppercorn bacon\n- french press coffee\n\nFries - tastes great, but this is a heavy dish.  You can have it as a main dish, but I would recommend it to share with others.  I love the mornay sauce and the garlic aioli.  I think the egg was little too much, but it's all about your preference.\n\nFrench Press Coffee - it's coffee, nothing special, other then the $7 you pay :)\n\nThick cut peppercorn bacon - this was the best dish in my opinion!  The pork belly smoked and cooked to perfection, you have to order this dish!\n\nCheeseburger - I got it with egg and bacon - bacon yes, egg no!  The cheeseburger also comes with cucumber spread what's been seasoned with mayo.  When you combine everything together, you get a mess!  Good burgers should be messy and I'm all for that... for me, I think bypassing the egg would be the way to go or have it over hard so it creates less mess as you enjoy the burger... the patties were medium rare which was nice!  \n\nTwo things - I was not a fan of the buns they used... the top portion of the bun was little dry.  The reason for giving 3 stars instead of 4 was due to piece of plastic that was found on the pickle they served with the burger.  I never noticed until I took a bite out of it... \n\nStreet park, get there 30 minutes before they open on the weekend to get seating right away if you don't want to wait... others put their name on the list, leave to do other things and return when they get a text message that their table is ready.  Next time I'm in town and should I make a revisit, will have to go in the afternoon to try their other offerings.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "This iconic Chicago burger joint has been on our to-do list for a long time. Finally that box is checked! Navigating the wait to get in is the tricky part but we managed to finagle a 90 minute wait vs a more typical 2-3 hour stint with some strategic planning in this small space. \n\nThe cocktails are really good here, which helps the wait time. Their burgers are pretty spectacular. The single has 2 perfectly cooked juicy patties, American cheese, pickles & their own special sauce served on maybe the best brioche hamburger bun ever. The meat to bun ratio is perfect however about halfway through I found the sauce to be a tad one note & added a little ketchup, much to the horror of my dining companions. Hey if they didn't want me to use ketchup, why did they put the bottle on the table? We also split a salad, fries, and got the bread & butter pickles. \n\nDefinitely one of the best burgers I've ever eaten & the bun was killer! The service was also great.", "author": "Mac R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "A lot of hype leads to high expectations. And they do deliver!! Heard a lot about this place, the double stacked burger as the best you'll ever eat, the long waits, the cool vibe in such a small place. \n\nTried to get in on Saturday as the kitchen opened at 5. They don't take reservations so you need to get your name on a list and they'll text you. Told there was a 3 hour wait. Too long for me to wait for any burger. Came back Sunday and was able to order in just under 90 minutes from arrival. Enjoyed some great cocktails as we waited - an unexpected bonus!\n\nIs it the best burger I've ever had? No, but it is certainly near the top. Don't know how they pack so much flavor into that double patty stack on an incredibly tasty bun. But they do. Cooked medium/medium rare it just bursts with flavor. A taste sensation indeed. And that bun alone is worth stopping in for!! Wow. Not worth a 3 hour wait but it certainly is a place you need to try. I'll sure be back.", "author": "Gary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Best burger of my life, indeed. As a West-Coaster, Au Cheval is essentially In-N-Out pumped up on steroids and immensely gratuitous but worth every bite. The combination of flavors and textures from the bacon and egg to the pickles and onions to the toast of the bun makes for an existential burger experience. \n\nI ordered the double burger but by no means would I recommend that to anyone else -- the single is more that adequate. Definitely upgrade your burger with the egg and bacon ($4.50 extra together) as they are totally worth it.\n\nWe ordered the special fries with the cheese sauce and egg. Also gratuitous and not needed, in my opinion. Stick with the classic fries if you're in the mood for them otherwise definitely split one of the other unique menu items.\n\nGreat service and a great reservation/waiting system, too. We arrived at 10:45am on a Saturday and we ended up waiting just a tad more than an hour after putting our names on the list just after 11am (opening).\n\nDefinitely a must-do at least once and it will carry you over until the next time you're in the city.", "author": "Aaron B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "I'd been hearing about this place for months from  many people. So on a trip to Chicago, I trucked over here through the snow on a Sunday night.\n\nTo start, be prepared for a insanely long wait anytime you come here. I came on a Sunday afternoon and the line was out the door into the snow, so I came back Sunday evening and \"only had to wait 40 minutes\". I grabbed a seat at the bar.\n\nLet's get straight to the point, the burger is excellent. I had the single cheeseburger with no runny egg and an order of fries, and it was sick. The biggest standout about the burger is the sauce. It has a powerful taste that reminds me of the sauce used on a big Mac. The end result is a burger that has a fast food taste, but with a gourmet twist. Delicious. \n\nThe restaurant is more like a blue collar diner and there isn't a lot of seating. Once you're in, things moves very quickly, so figure out what you want and order. They also serve drinks here and a bunch of wines. I had a nice glass of red with my burger.\n\nAll in all, this place is a must if in Chicago. I can't say it's the best burger I've ever had, but it's top three for sure. Get here!", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Wow. I'm not a burger person, but this burger was literally the best I've had in my entire life.\n\nMy boyfriend and I came here on a Sunday night and were surprised with a 3 hour wait (they do not take reservations). So we decided to come back Monday for lunch and the wait was only 30 minutes (they actually sent me a text 10 minutes later - yay!). We were seated at the bar and I was fascinated by how the chefs cooked the orders. We ordered a single burger (no cheese) with fried egg (+$2), a double cheeseburger with fried egg (+$2) and thick cut bacon (+$3.50), and crispy fries with mornay sauce, garlic aioli and fried egg. We also got a canned beer and the Flapper cocktail drink. \n\nDo yourself a favor and don't wear a sweater because this food will fire you up. The single burger actually comes with two thin patties and the double burger comes with three. The patties were cooked medium/medium rare, the way they taste best. The fried eggs were cooked to perfection and bacon was sweet, perfectly crispy and just the right amount of fat. Together, the burger was just the ultimate combo. The burger order doesn't come with any sides except a dill pickle. Don't underestimate this dill pickle though, because after a very tasty yet heavy burger, the acidity in the dill pickle will make you feel a lot better about yourself. The crispy fries were a little too crispy for my liking, but the sauces were delicious! The Flapper is gin, pepper, lemon, honey and fernet - sharp, crisp and refreshing.\n\nThere are so many other unique menu items I would love to try if I'm ever back in Chicago.", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Special place to say the least. So good. Not just the food, but also the space, the vibe, the energy, the music, the drinks, the crowd, the decor, the noise level, the ambiance, the service. Also I had no wait which I guess is pretty unusual and adds to the pleasure. The waitress was so great, she was always there to ask if everything was ok and bring whatever. Sorry I can't review the burger because I didn't have room. I ordered a burger but also chopped liver to start and then couldn't pile a burger on top. The chopped liver was so rich and delicious along with buttered toast and a stack of cornichons, which were the perfect foil. It was coarsely chopped, perfectly seasoned and contained some dill, I think. The beverage choice is huge; I had a glass of champagne and a hefeweissbier.\n\nLove the menu. Brendan failed once, with his deli concept, Dillman's. Now at Au Cheval we find matzoh ball soup, chopped liver, omelets and hash browns. Moral of the story -- if you can't bring people to the deli, bring the deli to the people. Save me a seat at the bar, please!", "author": "Jeff J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "A Chicago staple, Au Cheval had always been on my list to check out. The wait time is infamous, but we stopped in at noon and only had a 20 minute wait. \n\nI had the single burger with an egg and bacon. Soooo good. I highly recommend making Au Cheval a place you check off your bucket list.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Wowzers. Alright, let's just start with the hype is real. Yes, you're going to have to wait a bit and maybe even awhile to get a seat, but I gotta say that was one damn good burger!\n\nAfter two years of living out here and frequent visits to Chicago over the past 5 years, I finally made it out to Au Cheval. Showed up just past 4pm on a Monday afternoon, as I've heard via word of mouth that the work crowd starts to show around 4:30pm and after that you can expect to wait hours on hours. We put in our name for two and the hostess let us know that our table would be ready within the hour and they would text us. Score. We ended up going to  Lone Wolf next door since the bar seating at Au Cheval was completely full. About half way through our first round and we get the text that they're ready for us. \n\nThe restaurant itself isn't that much bigger than a diner. The use of darker woods and low lights on the inside gave it a casual/classy ambiance and I was totally feeling the 80s & 90s throwback jams that they were bumping. Waiter was prompt to bring out menus and a decent selection of craft beers to choose from on tap which I had noticed initially from the lines of taps at the barfront near the entrance. I ended up going with a smuttynose robust porter which was pretty tasty, but filling at the same time. For food, we did an order of general jane's honey-fried chicken w/ chili, sesame seeds, & cilantro. My oh my that was some fried goodness. Sticky, sweet, spicy and perfectly fried chicken. Thank goodness they bring it out with moist towels to wipe yourself after because who uses a knife and fork to eat fried chicken. Not me! \n\nOf course we did their burgers for the main entree/finale, a single cheeseburger for her and a double cheeseburger for me. Now let me just say here at Au Cheval, a single = two patties and a double = three patties. Had I known this ahead of time, a \"single cheeseburger\" would've served me well. We both opted for a fried egg and their extra thick cut bacon. By the time I stacked my burger, it could've been mistaken for a quadruple cheeseburger. How'd it taste you say? I've never had a burger with that amount of richness & juiciness and that fried egg and bacon just puts it over the top. In short, BEST BURGER EVER.  \n\nI'll leave it at that. This one is a Chicago rite of passage. \n\n'Til next time, cheers!\n\n17/365", "author": "Francis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "6 words: It lives up to the hype.\n\nI arrived here around 4pm on a Monday with the intent of beating the after-work crowd. I expected a 1-2 hour wait, but was told I would be seated \"within the hour.\" I put my name in (and phone number, as their waitlist was powered by Nowait), and headed next door for a beer to kill time. Au Cheval has a bar too but it's a relatively small restaurant and the bar was overly crowded.\n\nI barely put my lips on my beer glass when I got a notification that my table was ready! I looked down - barely 15 minutes. Not bad, not bad. I quickly finished my beer and headed back to the restaurant.\n\nWe ordered: the chicken wings, a double cheeseburger, and a single cheeseburger. Of course we got eggs and bacon on the burgers.\n\nThe wings: The only slightly disappointing thing we tasted. The wings were good, but a little overly sweet. The thing that I wasn't a fan of though? If you're going to charge $17.99 for six chicken wings, they better be DAMN GOOD. These were good, just not anything to brag about.\n\nThe burgers. Holy goodness were these things bigger than expected. And rich. the bacon gave the whole thing a sense of umami. The egg - perfect. And the patties? Well, the \"single\" burger was really composed of two patties, so that was a pleasant surprise. Everything was so good, though heavy.\n\nThe drink list: more extensive than I would have thought, and luckily not too up-charged, which was appreciated. You can still grab a craft beer for $6-7, which, considering the location, is quite reasonable.\n\nBy no means is this restaurant large, so plan accordingly. Cheers!", "author": "Jean L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Would give this place 3.5 stars. Minus that .5 because of a little mishap with putting our name down.\n\nBestie and I came met up with a friend of hers here around 5 on a rainy Monday night. He arrived first and put us down for 3. Host said the wait would be 40mins-1hr. Decided to trek a couple blocks to the monster toy door for fun. Came back and waited. After basically waiting an hour and not being called, we checked in at the stand to find out our names weren't even down and never received a confirmation text even though we gave a number. It was upsetting and we were put on the list for real this time and got a confirmation text. Went to Whole Foods and my friends had a drink at the bar. From the confirmation we were able to see how many people were ahead of us, which was nice.It went down pretty fast, we're guessing people dipped out because of the wait. We waited roughly another hour before we were seated. We ordered...\n\n-bone marrow ($17.95): Came with 4 pieces of marrow, bread, and marmalade. This was bestie and her friend's first time trying bone marrow. They weren't impressed but were glad to have tried. I enjoyed it a lot. I really liked the marmalade that it came with.\n\n-single cheese burger($10.95): Best and I split a burger. We added an egg ($1) and the famous bacon ($3.50). Even though it was a single, it came with two patties! The bacon was pretty darn good but adding it on for the price only gave you two small pieces. :(\n\n-fries($5.95) Fries were yum. I kept the marmalade from the bone marrow and dipped my fries in it :3\n\n-smashed potato(5.95): If you like mashed potatoes, Get it, they're good!\n\nService overall was great! Our server was friendly and attentive. Waters were always topped off. Lighting was very dim inside. With the music it gave off a very lively, but dark feel? Taha.", "author": "Tina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "MUST TRY BURGERS!!! \n\nI got the single cheeseburger with bacon and egg added to it. DELICIOUS! The bacon is almost like a millionaires bacon, super thick and sweet. Goes really well with the sunny side egg that melts over the whole burger.\n\nAlso got crispy fries with mornay sauce, garlic aioli and fried farm egg. The mornay sauce didn't really taste like anything and the garlic aioli was really flavorful. We also got a side of duck gravy to go along with this. The duck heart gravy is super thick filled with chicken, minced duck heart, sausage and gravy... Sounds exotic but a must try!!", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "The best burger I've ever had in my life. \n\nSmall place with a great vibe. Be prepared to wait for a table or go during off-times. I promise you, this burger is worth the wait. \n\nDouble burger patty, soaked in bone marrow, medium rare, with pickles & onion. KNOCK OUT. This thing is so damn flavorful. \n\nNecessary additions:\n- thick bacon, perfectly seasoned and not fatty like a pork belly. This really adds to the final burger taste explosion\n- egg on top, get the yoke flowing, pile on the juiciness", "author": "Eric P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Not the first time here (or the last) but finally tried ordering something besides just the burger and fries... It's just so hard to say no to one of the best burgers on the planet... \n\nSo went with a group and was able to get a few more things off the menu then usual:\n\n- chicken liver app- creamy, tangy, good... Super rich though, would recommend sharing\n\n- bologna sandwich- so this was a little too salty for me but went over well at the table... made me a little nostalgic for the fried bologna sandwiches my dad used to make me as a kid \n\n- fries - yep they're good... I actually prefer the plain fries with garlic aioli to the version with mornay/egg but all versions are good... \n\n- burger- so the star of the show... My favorite version of this is the basic single cheeseburger, nothing added... It's the perfect amount of meat/cheese/sauce/toasted bun that comes together deliciously to be one of the best burgers period... However I do change it up at times- egg when I'm feeling super indulgent (as if the cheeseburger alone isn't enough)... last time it was all in with a double- this was too much for me (shocking I know) but now I can say I've tried the full array of options before deciding on a fav\n\n- dessert - yup there was more ( everything was shared, stop judging) ... Had the Mille feuille (aka Napoleon) and it was good, a nice light ending to the meal\n\nI then walked the mile home in attempt to delay the impending heart attack... Totally worth it", "author": "Tazeen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Be prepared for a worth wild wait. Our wait time was approximately two hours, there are plenty of bars on Randolph close by to kill some time. We luckily got a seat at the bar (first come first serve). Sitting at the bar made the experience even better. Sodikoff likes to have an open kitchen setting, so watching these chefs roll out burgers, fries, and other items was incredible. \n\nI got the cheese burger with fried egg on top, and split the fries and butter & bread pickles with my friend. \n\nThe burger was full of great flavor, not messy at all, delicately placed on the plate. The burger was cooked to perfection. There is a sauce on there almost like a dijonaise sauce that will make your mouth water.  I didn't want to stop eating this burger. The fries were golden brown and the perfect amount of crisp too and had a garlic aioli type of dipping sauce. The bread & butter pickles were a nice side too. \n\nIf you want one of the best burgers in Chicago, be prepared for a great wait for an exciting experience.", "author": "Rebecca J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "I'm not going with the masses and agreeing it's the best taste I ever tasted. \n\nI'm real so I will break down my experience....\n\nThe worst bloody marry that has ever touched my taste buds. Over garnished and over salted way to rich not drinkable. It was like drinking the texture of a seed tomatoes milk shake. \n\nMy girl put it aside and I refused to pay for a drink and not get my money's worth. BIG MISTAKE \n\nSo my buds were over salted. \n\nThe fries with the fried egg came out and they cooled down my buds and they were fantastic!!!!\n\nThe burgers finally come out......\n\nTo me and just me they were out of control Rich. Way too much going on and it felt like a huge bite of salt and maybe my buds were shocked so it was painful. The bacon, patties, cheese and garnishment were to much for me. Every bite was too much for me I was washing them down with water. Every bite was painful and I really tried to love it and talk about how good it tasted. I needed a big gulp of water after every bite. Until I decided I was not enjoying I was tolerating. \n\nI started to think how manny people agree it's great in conversation. \n\nAgain my experience...", "author": "Luis G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-05", "description": "So excited to finally try Au Cheval and the famous burger. We got there thinking we would have to wait about hour or so to be seated. But thank god we got seated within 10 minutes. \n\nWe were seated in a booth the scene was nice and actually kinda romantic loved the lighting at the table. Not sure why but I really enjoyed the little light shining in the middle of the table. Waiter came took our order was very nice waiter (forgot to catch his name ) ordered the burger with egg and bacon on top with side of fries. \n\nDidn't take to long for the food to be served. But when I tried the burger I was bit disappointed. I was expecting a lot more. The pickles and sauce that was on the burger tasted like relish and I hate relish. But the person I was with actually loved the burger. So to each his own, I do have to say this they do have one of the best bacon I've ever had in my life. I love bacon and was very surprised how good it tasted. The fries and dip were also really good. \n\n\nI would probably come back and try the burger without the pickles and the sauce that was on it. All in all it was ok for my first time.", "author": "Jesse M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Au Cheval", "address": {"addressLocality": "Chicago", "addressRegion": "IL", "streetAddress": "800 W Randolph St", "postalCode": "60607", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/y68eni2gQUs0jd_u79tpkA/ls.jpg", "@type": "Restaurant", "telephone": "+13129294580"}